fras/tm4c1294-hw-demo/Firmware/hw_demo.c
// File: hw_demo.c
// Auth: M. Fras, Electronics Division, MPI for Physics, Munich
// Mod.: M. Fras, Electronics Division, MPI for Physics, Munich
// Date: 07 Feb 2020
// Rev.: 27 Aug 2020
//
// Hardware demo for the TI Tiva TM4C1294 Connected LaunchPad Evaluation Kit.
//



#include <stdbool.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <strings.h>
#include "inc/hw_memmap.h"
#include "inc/hw_nvic.h"
#include "inc/hw_types.h"
#include "driverlib/i2c.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "driverlib/ssi.h"
#include "driverlib/sysctl.h"
#include "driverlib/uart.h"
#include "utils/uartstdio.h"
#include "hw/adc/adc.h"
#include "hw/gpio/gpio.h"
#include "hw/gpio/gpio_button.h"
#include "hw/gpio/gpio_led.h"
#include "hw/i2c/i2c.h"
#include "hw/i2c/i2c_tmp006.h"
#include "hw/i2c/i2c_opt3001.h"
#include "hw/lcd/Crystalfontz128x128_ST7735.h"
#include "hw/lcd/images.h"
#include "hw/lcd/lcd.h"
#include "hw/pwm/pwm_rgb_led.h"
#include "hw/ssi/ssi.h"
#include "hw/system/system.h"
#include "hw/uart/uart.h"
#include "uart_ui.h"
#include "hw_demo.h"
#include "hw_demo_io.h"



// The error routine that is called if the driver library encounters an error.
#ifdef DEBUG
void __error__(char *pcFilename, uint32_t ui32Line)
{
    UARTprintf("%s: Unhandled error occured in file `%s', line %d.\n", UI_STR_FATAL, pcFilename, ui32Line);
}
#endif



// Global variables.
uint32_t g_ui32SysClock;



// Function prototypes.
void Help(void);
void Info(void);
int DelayUs(uint32_t ui32DelayUs);
int DelayUsCmd(char *pcCmd, char *pcParam);
int McuReset(char *pcCmd, char *pcParam);
int JumpToBootLoader(char *pcCmd, char *pcParam);
int AdcRead(char *pcCmd, char *pcParam);
int ButtonGet(char *pcCmd, char *pcParam);
int LcdCmd(char *pcCmd, char *pcParam, tLcdFwInfo *psLcdFwInfo);
int LcdCheckParamCnt(char *pcLcdCmd, int iLcdParamCntActual, int iLcdParamCntTarget);
void LcdHelp(void);
int LedGetSet(char *pcCmd, char *pcParam);
int RgbLedSet(char *pcCmd, char *pcParam);
int I2CAccess(char *pcCmd, char *pcParam);
void I2CAccessHelp(void);
int I2CPortCheck(uint8_t ui8I2CPort, tI2C **psI2C);
int I2CDetect(char *pcCmd, char *pcParam);
int TemperatureRead(char *pcCmd, char *pcParam);
int IlluminanceRead(char *pcCmd, char *pcParam);
int SsiAccess(char *pcCmd, char *pcParam);
int SsiPortCheck(uint8_t ui8SsiPort, tSSI **psSsi);
int SsiSetup(char *pcCmd, char *pcParam);
void SsiSetupHelp(void);
int UartAccess(char *pcCmd, char *pcParam);
int UartPortCheck(uint8_t ui8UartPort, tUART **psUart);
int UartSetup(char *pcCmd, char *pcParam);
void UartSetupHelp(void);



// Initialize hardware, get and process commands.
int main(void)
{
    char pcUartStr[UI_STR_BUF_SIZE];
    char *pcUartCmd;
    char *pcUartParam;

    // Set up the system clock.
    g_ui32SysClock = MAP_SysCtlClockFreqSet(SYSTEM_CLOCK_SETTINGS, SYSTEM_CLOCK_FREQ);

    // Initialize the UART for the user interface.
    g_sUartUi.ui32SrcClock = g_ui32SysClock;
    UartUiInit(&g_sUartUi);

    // Initialize the ADCs.
    AdcReset(&g_sAdcJoystickX);
    AdcInit(&g_sAdcJoystickX);
    AdcInit(&g_sAdcJoystickY);
    AdcReset(&g_sAdcAccelX);
    AdcInit(&g_sAdcAccelX);
    AdcInit(&g_sAdcAccelY);
    AdcInit(&g_sAdcAccelZ);

    // Initialize the user buttons.
    GpioButtonInit();

    // Initialize the LEDs.
    GpioLedInit();

    // Initialize the RGB LED on the Educational BoosterPack MK II.
    PwmRgbLedInit();

    // Initialize the I2C master for the BoosterPack 1 socket.
    g_sI2C0.ui32I2CClk = g_ui32SysClock;
    I2CMasterInit(&g_sI2C0);

    // Initialize the I2C master for the Educational BoosterPack MK II
    // (BoosterPack 2 socket).
    g_sI2C2.ui32I2CClk = g_ui32SysClock;
    I2CMasterInit(&g_sI2C2);

    // Initialize the I2C devices.
    I2CTmp006Reset(&g_sI2C2, EDUMKII_I2C_TMP006_SLV_ADR);
    I2CTmp006Init(&g_sI2C2, EDUMKII_I2C_TMP006_SLV_ADR);
    I2COpt3001Reset(&g_sI2C2, EDUMKII_I2C_OPT3001_SLV_ADR);
    I2COpt3001Init(&g_sI2C2, EDUMKII_I2C_OPT3001_SLV_ADR);

    // Initialize SSI 2 for BoosterPack 1.
    g_sSsi2.ui32SsiClk = g_ui32SysClock;
    SsiMasterInit(&g_sSsi2);

    // Initialize SSI 3 for BoosterPack 2.
    g_sSsi3.ui32SsiClk = g_ui32SysClock;
    SsiMasterInit(&g_sSsi3);

    // Initialize the UART on the Educational BoosterPack MKII.
    g_sUart6.ui32UartClk = g_ui32SysClock;
//    g_sUart6.bLoopback = true;        // Enable loopback for testing.
    UartInit(&g_sUart6);

    // Initialize the LCD on the Educational BoosterPack MKII.
    tContext sContext;
    LcdInit(&sContext);
    LcdSetOrientation(&sContext, LCD_ORIENTATION_UP);
    tLcdFwInfo sLcdFwInfo;
    sLcdFwInfo.psContext            = &sContext;
    sLcdFwInfo.ui32ColorBackground  = LCD_COLOR_WHITE;
    sLcdFwInfo.ui32ColorFrame       = LCD_COLOR_MPG_GREY_DARK;
    sLcdFwInfo.ui32ColorSeparator   = LCD_COLOR_MPG_GREEN_2;
    sLcdFwInfo.ui32ColorTitle       = LCD_COLOR_MPG_GREEN_1;
    sLcdFwInfo.ui32ColorText        = LCD_COLOR_BLACK;
    sLcdFwInfo.pcTitle              = "TIVA TM4C1294";
    sLcdFwInfo.pcFwName             = FW_NAME;
    sLcdFwInfo.pcFwVersion          = FW_VERSION;
    sLcdFwInfo.pcFwDate             = FW_RELEASEDATE;
    sLcdFwInfo.pu8ImageData         = g_pui8LogoMpp;
//    sLcdFwInfo.i32ImageX            = LCD_FRAME_PADDING + LCD_FRAME_WIDTH + LCD_CONTENT_PADDING;
    sLcdFwInfo.i32ImageX            = -1;           // -1 = Auto center image.
    sLcdFwInfo.i32ImageY            = 72;
    LcdFwInfo(&sLcdFwInfo);

    // Send initial information to UART.
    UARTprintf("\n\n*******************************************************************************\n");
    UARTprintf("TIVA TM4C1294 `%s' firmware version %s, release date: %s\n", FW_NAME, FW_VERSION, FW_RELEASEDATE);
    UARTprintf("*******************************************************************************\n\n");
    UARTprintf("Type `help' to get an overview of available commands.\n");

    while(1)
    {
        UARTprintf("%s", UI_COMMAND_PROMPT);
        UARTgets(pcUartStr, UI_STR_BUF_SIZE);
        pcUartCmd = strtok(pcUartStr, UI_STR_DELIMITER);
        pcUartParam = strtok(NULL, UI_STR_DELIMITER);
        if (pcUartCmd == NULL) {
            continue;
        // Show help.
        } else if (!strcasecmp(pcUartCmd, "help")) {
            Help();
        // Show info.
        } else if (!strcasecmp(pcUartCmd, "info")) {
            Info();
        // Delay execution for a given number of microseconds.
        } else if (!strcasecmp(pcUartCmd, "delay")) {
            DelayUsCmd(pcUartCmd, pcUartParam);
        // Reset the MCU.
        } else if (!strcasecmp(pcUartCmd, "reset")) {
            McuReset(pcUartCmd, pcUartParam);
        // Enter the boot loader for firmware update over UART.
        } else if (!strcasecmp(pcUartCmd, "bootldr")) {
            JumpToBootLoader(pcUartCmd, pcUartParam);
        // ADC based functions.
        } else if (!strcasecmp(pcUartCmd, "adc")) {
            AdcRead(pcUartCmd, pcUartParam);
        // GPIO button based functions.
        } else if (!strcasecmp(pcUartCmd, "button")) {
            ButtonGet(pcUartCmd, pcUartParam);
        // I2C based functions.
        } else if (!strcasecmp(pcUartCmd, "i2c")) {
            I2CAccess(pcUartCmd, pcUartParam);
        } else if (!strcasecmp(pcUartCmd, "i2c-det")) {
            I2CDetect(pcUartCmd, pcUartParam);
        } else if (!strcasecmp(pcUartCmd, "temp")) {
            TemperatureRead(pcUartCmd, pcUartParam);
        } else if (!strcasecmp(pcUartCmd, "illum")) {
            IlluminanceRead(pcUartCmd, pcUartParam);
        // LCD based functions.
        } else if (!strcasecmp(pcUartCmd, "lcd")) {
            LcdCmd(pcUartCmd, pcUartParam, &sLcdFwInfo);
        // GPIO LED based functions.
        } else if (!strcasecmp(pcUartCmd, "led")) {
            LedGetSet(pcUartCmd, pcUartParam);
        // PWM based functions.
        } else if (!strcasecmp(pcUartCmd, "rgb")) {
            RgbLedSet(pcUartCmd, pcUartParam);
        // SSI based functions.
        } else if (!strcasecmp(pcUartCmd, "ssi")) {
            SsiAccess(pcUartCmd, pcUartParam);
        } else if (!strcasecmp(pcUartCmd, "ssi-set")) {
            SsiSetup(pcUartCmd, pcUartParam);
        // UART based functions.
        } else if (!strcasecmp(pcUartCmd, "uart")) {
            UartAccess(pcUartCmd, pcUartParam);
        } else if (!strcasecmp(pcUartCmd, "uart-s")) {
            UartSetup(pcUartCmd, pcUartParam);
//        } else if (!strcasecmp(pcUartCmd, "sysclk")) {
//            pcUartParam = strtok(NULL, UI_STR_DELIMITER);
//            if (pcUartParam == NULL) {
//                UARTprintf("ERROR: Parameter required after command `%s'.", pcUartCmd);
//            } else {
//                ui32User0 = strtoul(pcUartParam, (char **) NULL, 0);
//                ui32User0 &= 0xff;
//                // Disable or enable the system clock output on the DIVSCLK pin (PQ4).
//                if (ui32User0 == 0) ClockOutputDisable();
//                else ClockOutputEnable(ui32User0);
//                UARTprintf("%s.", UI_STR_OK);
//            }
        } else {
            UARTprintf("ERROR: Unknown command `%s'.", pcUartCmd);
        }
        UARTprintf("\n");
    }
}



// Show help.
void Help(void)
{
    UARTprintf("Available commands:\n");
    UARTprintf("  help                                Show this help text.\n");
    UARTprintf("  adc     [COUNT]                     Read ADC values.\n");
    UARTprintf("  bootldr                             Enter the boot loader for firmware update.\n");
    UARTprintf("  button  [INDEX]                     Get the status of the buttons.\n");
    UARTprintf("  delay   MICROSECONDS                Delay execution.\n");
    UARTprintf("  i2c     PORT SLV-ADR ACC NUM|DATA   I2C access (ACC bits: R/W, Sr, nP, Q).\n");
    UARTprintf("  i2c-det PORT [MODE]                 I2C detect devices (MODE: 0 = auto,\n");
    UARTprintf("                                          1 = quick command, 2 = read).\n");
    UARTprintf("  illum   [COUNT]                     Read ambient light sensor info.\n");
    UARTprintf("  info                                Show information about this firmware.\n");
    UARTprintf("  lcd     CMD PARAMS                  LCD commands.\n");
    UARTprintf("  led     [VALUE]                     Get/Set the value of the user LEDs.\n");
    UARTprintf("  reset                               Reset the MCU.\n");
    UARTprintf("  rgb     VALUE                       Set the RGB LED (RGB value = 0xRRGGBB).\n");
    UARTprintf("  ssi     PORT R/W NUM|DATA           SSI/SPI access (R/W: 0 = write, 1 = read).\n");
    UARTprintf("  ssi-set PORT FREQ [MODE] [WIDTH]    Set up the SSI port.\n");
    UARTprintf("  temp    [COUNT]                     Read temperature sensor info.\n");
    UARTprintf("  uart    PORT R/W NUM|DATA           UART access (R/W: 0 = write, 1 = read).\n");
    UARTprintf("  uart-s  PORT BAUD [PARITY] [LOOP]   Set up the UART port.");
}



// Show information.
void Info(void)
{
    UARTprintf("TIVA TM4C1294 `%s' firmware version %s, release date: %s\n", FW_NAME, FW_VERSION, FW_RELEASEDATE);
    UARTprintf("It was compiled using gcc %s at %s on %s.", __VERSION__, __TIME__, __DATE__);
}



