fras/tm4c1294-hw-demo/Firmware/hw_demo.c
// Delay execution for a given number of microseconds.
int DelayUs(uint32_t ui32DelayUs)
{
    // Limit the delay to max. 10 seconds.
    if (ui32DelayUs > 1e7) ui32DelayUs = 1e7;
    // CAUTION: Calling SysCtlDelay(0) will hang the system.
    if (ui32DelayUs > 0)
        // Note: The SysCtlDelay executes a simple 3 instruction cycle loop.
        SysCtlDelay((g_ui32SysClock / 3e6) * ui32DelayUs);

    return 0;
}



// Delay execution for a given number of microseconds.
int DelayUsCmd(char *pcCmd, char *pcParam)
{
    uint32_t ui32DelayUs;

    if (pcParam == NULL) {
        UARTprintf("%s: Parameter required after command `%s'.", UI_STR_ERROR, pcCmd);
        return -1;
    }
    ui32DelayUs = strtoul(pcParam, (char **) NULL, 0);
    // Limit the delay to max. 10 seconds.
    if (ui32DelayUs > 1e7) ui32DelayUs = 1e7;
    // CAUTION: Calling SysCtlDelay(0) will hang the system.
    if (ui32DelayUs > 0)
        // Note: The SysCtlDelay executes a simple 3 instruction cycle loop.
        SysCtlDelay((g_ui32SysClock / 3e6) * ui32DelayUs);

    UARTprintf("%s.", UI_STR_OK);

    return 0;
}



// Reset the MCU.
int McuReset(char *pcCmd, char *pcParam)
{
    char pcUartStr[4];

    UARTprintf("Do you really want to reset the MCU (yes/no)? ");
    UARTgets(pcUartStr, 4);

    if (!strcasecmp(pcUartStr, "yes")) {
        UARTprintf("%s. Resetting the MCU.", UI_STR_OK);
        // Wait some time for the UART to send out the last message.
        DelayUs(1e5);

        SysCtlReset();
    } else {
        UARTprintf("Reset aborted.");
    }

    return 0;
}

// Passes control to the boot loader and initiates a remote software update.
// This function is based on the EK-TM4C1294XL boot_demo1 example.
int JumpToBootLoader(char *pcCmd, char *pcParam)
{
    char pcUartStr[4];

    UARTprintf("Do you really want to jump to the serial boot loader (yes/no)? ");
    UARTgets(pcUartStr, 4);

    if (!strcasecmp(pcUartStr, "yes")) {
        UARTprintf("%s. Entering the serial boot loader on UART %d.\n", UI_STR_OK, g_sUartUi.ui32Port);
        // Wait some time for the UART to send out the last message.
        DelayUs(1e5);

        // Code copied from the EK-TM4C1294XL boot_demo1 example.

        // We must make sure we turn off SysTick and its interrupt before entering 
        // the boot loader!
        MAP_SysTickIntDisable(); 
        MAP_SysTickDisable(); 

        // Disable all processor interrupts.  Instead of disabling them
        // one at a time, a direct write to NVIC is done to disable all
        // peripheral interrupts.
        HWREG(NVIC_DIS0) = 0xffffffff;
        HWREG(NVIC_DIS1) = 0xffffffff;
        HWREG(NVIC_DIS2) = 0xffffffff;
        HWREG(NVIC_DIS3) = 0xffffffff;

        // Return control to the boot loader.  This is a call to the SVC
        // handler in the boot loader.
        (*((void (*)(void))(*(uint32_t *)0x2c)))();
    } else {
        UARTprintf("Operation aborted.");
    }

    return 0;
}



// Read values from the ADCs.
int AdcRead(char *pcCmd, char *pcParam)
{
    uint32_t ui32Adc;
    int iCnt;

    if (pcParam == NULL) {
        iCnt = 1;
    } else {
        iCnt = strtoul(pcParam, (char **) NULL, 0) & 0xffffff;
    }

    for (int i = 0; i < iCnt; i++) {
        UARTprintf("%s: ", UI_STR_OK);
        #ifdef ADC_VALUES_HEX
        // Joystick.
        ui32Adc = AdcConvert(&sAdcJoystickX);
        UARTprintf("Joystick: X = 0x%03x ", ui32Adc);
        ui32Adc = AdcConvert(&sAdcJoystickY);
        UARTprintf("Y = 0x%03x", ui32Adc);
        // Accelerometer.
        ui32Adc = AdcConvert(&sAdcAccelX);
        UARTprintf(" ; Accelerometer: X = 0x%03x", ui32Adc);
        ui32Adc = AdcConvert(&sAdcAccelY);
        UARTprintf(" Y = 0x%03x", ui32Adc);
        ui32Adc = AdcConvert(&sAdcAccelZ);
        UARTprintf(" Z = 0x%03x", ui32Adc);
        #else
        // Joystick.
        ui32Adc = AdcConvert(&g_sAdcJoystickX);
        UARTprintf("Joystick: X = %4d ", ui32Adc);
        ui32Adc = AdcConvert(&g_sAdcJoystickY);
        UARTprintf("Y = %4d", ui32Adc);
        // Accelerometer.
        ui32Adc = AdcConvert(&g_sAdcAccelX);
        UARTprintf(" ; Accelerometer: X = %4d", ui32Adc);
        ui32Adc = AdcConvert(&g_sAdcAccelY);
        UARTprintf(" Y = %4d", ui32Adc);
        ui32Adc = AdcConvert(&g_sAdcAccelZ);
        UARTprintf(" Z = %4d", ui32Adc);
        #endif
        if (i < iCnt - 1) {
            DelayUs(5e4);
            UARTprintf("\n");
        }
    }

    return 0;
}



// Get the status of the GPIO buttons.
int ButtonGet(char *pcCmd, char *pcParam)
{
    uint32_t ui32ButtonIndex;

    if (pcParam == NULL) {
        UARTprintf("%s. ", UI_STR_OK);
        UARTprintf("Button %d..0 status: 0x%01x", GPIO_BUTTON_NUM - 1, GpioButtonGet());
    } else {
        ui32ButtonIndex = strtoul(pcParam, (char **) NULL, 0);
        if (ui32ButtonIndex >= GPIO_BUTTON_NUM) {
            UARTprintf("%s: Button index %d outside of valid range 0..%d.", UI_STR_ERROR, ui32ButtonIndex, GPIO_BUTTON_NUM - 1);
            return -1;
        }
        UARTprintf("%s. ", UI_STR_OK);
        UARTprintf("Button %d status: 0x%1x, pressed count: %d, released count: %d",
                   ui32ButtonIndex, g_ui8GpioButtonStatus[ui32ButtonIndex],
                   g_ui32GpioButtonPressedCnt[ui32ButtonIndex],
                   g_ui32GpioButtonReleasedCnt[ui32ButtonIndex]);
    }
    return 0;
}



// LCD commands.
int LcdCmd(char *pcCmd, char *pcParam, tLcdFwInfo *psLcdFwInfo)
{
    char *pcLcdCmd = pcParam;
    #define LCD_CMD_PARAM_MAX 64
    char *pcLcdParam[LCD_CMD_PARAM_MAX];
    int iLcdParamCnt = 0;
    int iRet = 0;

    // String to store the LCD text parameter.
    char pcLcdText[UI_STR_BUF_SIZE] = "";

    if (pcLcdCmd == NULL) {
        UARTprintf("%s: LCD command required after command `%s'.\n", UI_STR_ERROR, pcCmd);
        LcdHelp();
        return -1;
    }
    // Parse parameters of the LCD command.
    for (int i = 0; i < LCD_CMD_PARAM_MAX; i++) {
        iLcdParamCnt = i;
        pcLcdParam[i] = strtok(NULL, UI_STR_DELIMITER);
        if (pcLcdParam[i] == NULL) break;
        // Stop splitting the string for the text command, as the last
        // parameter is of the type string a may contain the deliminator
        // string.
        if (!strcasecmp(pcLcdCmd, "text") && (i == 3)) {
            // Pointer to string past terminating 0 of parameter 4;
            char *pcTmp = pcLcdParam[i] + strlen(pcLcdParam[i]) + 1;
            // Cut off deliminators at the beginning.
            pcTmp += strspn(pcTmp, UI_STR_DELIMITER);
            // Copy text parameter without leading deliminator to text parameter string.
            strncpy(pcLcdText, pcTmp, UI_STR_BUF_SIZE - 1);
            if (strtok(NULL, UI_STR_DELIMITER) != 0) {
                iLcdParamCnt = 5;
            } else {
                iLcdParamCnt = 4;
            }
            break;
        }
    }
    // Show help on LCD commands.
    if (!strcasecmp(pcLcdCmd, "help")) {
        LcdHelp();
        return 0;
    // Show info.
    } else if (!strcasecmp(pcLcdCmd, "info")) {
        if ((iRet = LcdCheckParamCnt(pcLcdCmd, iLcdParamCnt, 0)) < 0) return iRet;
        LcdFwInfo(psLcdFwInfo);
    // Draw circle.
    } else if (!strcasecmp(pcLcdCmd, "circle")) {
        if ((iRet = LcdCheckParamCnt(pcLcdCmd, iLcdParamCnt, 5)) < 0) return iRet;
        LcdDrawCircle(psLcdFwInfo->psContext,
                      strtol(pcLcdParam[0], (char **) NULL, 0),     // i32X
                      strtol(pcLcdParam[1], (char **) NULL, 0),     // i32Y
                      strtol(pcLcdParam[2], (char **) NULL, 0),     // iRadius
                      strtoul(pcLcdParam[3], (char **) NULL, 0),    // ui32Color
                      strtoul(pcLcdParam[4], (char **) NULL, 0));   // bFill
    // Fill the display with a color.
    } else if (!strcasecmp(pcLcdCmd, "clear")) {
        if ((iRet = LcdCheckParamCnt(pcLcdCmd, iLcdParamCnt, 1)) < 0) return iRet;
        LcdClear(psLcdFwInfo->psContext,
                 strtoul(pcLcdParam[0], (char **) NULL, 0));        // ui32Color
    // Draw a line.
    } else if (!strcasecmp(pcLcdCmd, "line")) {
        if ((iRet = LcdCheckParamCnt(pcLcdCmd, iLcdParamCnt, 5)) < 0) return iRet;
        LcdDrawLine(psLcdFwInfo->psContext,
                    strtol(pcLcdParam[0], (char **) NULL, 0),       // i32X1
                    strtol(pcLcdParam[1], (char **) NULL, 0),       // i32Y1
                    strtol(pcLcdParam[2], (char **) NULL, 0),       // i32X2
                    strtol(pcLcdParam[3], (char **) NULL, 0),       // i32Y2
                    strtoul(pcLcdParam[4], (char **) NULL, 0));     // ui32Color
    // Change the orientation of the display.
    } else if (!strcasecmp(pcLcdCmd, "orient")) {
        if ((iRet = LcdCheckParamCnt(pcLcdCmd, iLcdParamCnt, 1)) < 0) return iRet;
        LcdSetOrientation(psLcdFwInfo->psContext,
                          strtoul(pcLcdParam[0], (char **) NULL, 0));   // ui8Orientation
    // Draw a pixel.
    } else if (!strcasecmp(pcLcdCmd, "pixel")) {
        if ((iRet = LcdCheckParamCnt(pcLcdCmd, iLcdParamCnt, 3)) < 0) return iRet;
        LcdDrawPixel(psLcdFwInfo->psContext,
                     strtol(pcLcdParam[0], (char **) NULL, 0),      // i32X
                     strtol(pcLcdParam[1], (char **) NULL, 0),      // i32Y
                     strtoul(pcLcdParam[2], (char **) NULL, 0));    // ui32Color
    // Draw a rectangle.
    } else if (!strcasecmp(pcLcdCmd, "rect")) {
        if ((iRet = LcdCheckParamCnt(pcLcdCmd, iLcdParamCnt, 6)) < 0) return iRet;
        LcdDrawRect(psLcdFwInfo->psContext,
                    strtol(pcLcdParam[0], (char **) NULL, 0),       // i16X1
                    strtol(pcLcdParam[1], (char **) NULL, 0),       // i16Y1
                    strtol(pcLcdParam[2], (char **) NULL, 0),       // i16X2
                    strtol(pcLcdParam[3], (char **) NULL, 0),       // i16Y2
                    strtoul(pcLcdParam[4], (char **) NULL, 0),      // ui32Color
                    strtoul(pcLcdParam[5], (char **) NULL, 0));     // bFill
    // Draw a text.
    } else if (!strcasecmp(pcLcdCmd, "text")) {
        if ((iRet = LcdCheckParamCnt(pcLcdCmd, iLcdParamCnt, 5)) < 0) return iRet;
        LcdDrawText(psLcdFwInfo->psContext,
                    pcLcdText,       // The text message.
                    strtol(pcLcdParam[0], (char **) NULL, 0),       // i32X
                    strtol(pcLcdParam[1], (char **) NULL, 0),       // i32Y
                    strtoul(pcLcdParam[2], (char **) NULL, 0),      // ui32Color
                    strtoul(pcLcdParam[3], (char **) NULL, 0));     // bCenter
    } else {
        UARTprintf("%s: Unknown LCD command `%s'!\n", UI_STR_ERROR, pcLcdCmd);
        LcdHelp();
        return -1;
    }
    if (iRet == 0) UARTprintf("%s.", UI_STR_OK);
    return iRet;
}



// Check the number of parameters given for an LCD command.
int LcdCheckParamCnt(char *pcLcdCmd, int iLcdParamCntActual, int iLcdParamCntTarget)
{
    if (iLcdParamCntActual < iLcdParamCntTarget) {
        UARTprintf("%s: The LCD command `%s' requires %d parameter%s, but only %d %s given!",
                   UI_STR_ERROR, pcLcdCmd, iLcdParamCntTarget, (iLcdParamCntTarget == 1) ? "" : "s",
                   iLcdParamCntActual, (iLcdParamCntActual == 1) ? "was" : "were");
        return -1;
    } else if (iLcdParamCntActual > iLcdParamCntTarget) {
        UARTprintf("%s: The LCD command `%s' requires %d parameter%s, but %d %s given! Ignoring the last %d parameter%s.",
                   UI_STR_ERROR, pcLcdCmd, iLcdParamCntTarget, (iLcdParamCntTarget == 2) ? "" : "s",
                   iLcdParamCntActual, (iLcdParamCntActual == 1) ? "was" : "were",
                   iLcdParamCntActual - iLcdParamCntTarget,
                   (iLcdParamCntActual - iLcdParamCntTarget == 1) ? "" : "s");
        return 1;
    }
    return 0;
}



// Show help on LCD commands.
void LcdHelp(void)
{
    UARTprintf("Available LCD commands:\n");
    UARTprintf("  help                                Show this help text.\n");
    UARTprintf("  info                                Show firmware info.\n");
    UARTprintf("  circle  X Y RADIUS COLOR FILL       Draw a circle.\n");
    UARTprintf("  clear   COLOR                       Fill the LCD with COLOR.\n");
    UARTprintf("  line    X1 Y1 X2 Y2 COLOR           Draw a line.\n");
    UARTprintf("  orient  ORIENT                      Set the LCD orientation.\n");
    UARTprintf("  pixel   X Y COLOR                   Draw a pixel.\n");
    UARTprintf("  rect    X1 Y1 X2 Y2 COLOR FILL      Draw a rectangle.\n");
    UARTprintf("  text    X Y COLOR CENTER TEXT       Draw a text message.");
}



// Get/Set the value of the user LEDs.
int LedGetSet(char *pcCmd, char *pcParam)
{
    uint32_t ui32LedSet, ui32LedGet;

