fras/tm4c1294-hw-demo/Firmware/hw_demo.c
    // Read the current value of the user LEDs if no parameter is given.
    if (pcParam == NULL) {
        UARTprintf("%s: Current LED value: 0x%01x", UI_STR_OK, GpioLedGet());
        return 0;
    }
    ui32LedSet = strtoul(pcParam, (char **) NULL, 0);
    GpioLedSet(ui32LedSet);
    ui32LedGet = GpioLedGet();
    if (ui32LedSet != ui32LedGet) {
        UARTprintf("%s: Setting the LEDs to 0x%01x failed!", UI_STR_ERROR, ui32LedSet);
        UARTprintf(" The LEDs were set to 0x%01x instead.", ui32LedGet);
        return -1;
    } else {
        UARTprintf("%s: LEDs set to 0x%01x.", UI_STR_OK, GpioLedGet());
        return 0;
    }
}



// Set the RGB LED on the Educational BoosterPack MK II.
int RgbLedSet(char *pcCmd, char *pcParam)
{
    uint32_t ui32RgbLedSet;

    if (pcParam == NULL) {
        UARTprintf("%s: Parameter required after command `%s'.", UI_STR_ERROR, pcCmd);
        return -1;
    } else {
        ui32RgbLedSet = strtoul(pcParam, (char **) NULL, 0) & 0xffffff;
        PwmRgbLedSet((ui32RgbLedSet & 0xff0000) >> 16, (ui32RgbLedSet & 0x00ff00) >> 8, (ui32RgbLedSet & 0x0000ff) >> 0);
        UARTprintf("%s: RGB LED set to 0x%06x.", UI_STR_OK, ui32RgbLedSet);
    }

    return 0;
}



// I2C access.
int I2CAccess(char *pcCmd, char *pcParam)
{
    int i;
    tI2C *psI2C;
    uint8_t ui8I2CPort = 0;
    uint8_t ui8I2CSlaveAddr = 0;
    uint8_t ui8I2CAccMode = 0;
    uint8_t ui8I2CRw = 0;           // 0 = write; 1 = read
    bool bI2CRepeatedStart = false; // Repeated start.
    bool bI2CStop = true;           // Generate stop condition.
    bool bI2CQuickCmd = false;      // Quick command.
    uint8_t ui8I2CDataNum = 0;
    uint8_t pui8I2CData[32];
    uint32_t ui32I2CMasterStatus;
    // Parse parameters.
    for (i = 0; i < sizeof(pui8I2CData) / sizeof(pui8I2CData[0]); i++) {
        if (i != 0) pcParam = strtok(NULL, UI_STR_DELIMITER);
        if (i == 0) {
            if (pcParam == NULL) {
                UARTprintf("%s: I2C port number required after command `%s'.\n", UI_STR_ERROR, pcCmd);
                I2CAccessHelp();
                return -1;
            } else {
                ui8I2CPort = (uint8_t) strtoul(pcParam, (char **) NULL, 0) & 0xff;
            }
        } else if (i == 1) {
            if (pcParam == NULL) {
                UARTprintf("%s: I2C slave address required after command `%s'.\n", UI_STR_ERROR, pcCmd);
                I2CAccessHelp();
                return -1;
            } else {
                ui8I2CSlaveAddr = (uint8_t) strtoul(pcParam, (char **) NULL, 0) & 0xff;
            }
        } else if (i == 2) {
            if (pcParam == NULL) {
                UARTprintf("%s: I2C access mode required after command `%s'.\n", UI_STR_ERROR, pcCmd);
                I2CAccessHelp();
                return -1;
            } else {
                ui8I2CAccMode = (uint8_t) strtoul(pcParam, (char **) NULL, 0) & 0x0f;
                ui8I2CRw = ui8I2CAccMode & 0x1;
                bI2CRepeatedStart = (ui8I2CAccMode & 0x2) ? true : false;
                bI2CStop = (ui8I2CAccMode & 0x4) ? false : true;
                bI2CQuickCmd = (ui8I2CAccMode & 0x8) ? true : false;
            }
        } else {
            if (i == 3 && ui8I2CRw == 0 && !bI2CQuickCmd && pcParam == NULL) {
                UARTprintf("%s: At least one data byte required after I2C write command `%s'.\n", UI_STR_ERROR, pcCmd);
                I2CAccessHelp();
                return -1;
            }
            if (pcParam == NULL) break;
            else pui8I2CData[i-3] = (uint8_t) strtoul(pcParam, (char **) NULL, 0) & 0xff;
        }
    }
    if (i < 3) return -1;
    // Check if the I2C port number is valid. If so, set the psI2C pointer to the selected I2C port struct.
    if (I2CPortCheck(ui8I2CPort, &psI2C)) return -1;
    // I2C quick command.
    if (bI2CQuickCmd) {
        ui32I2CMasterStatus = I2CMasterQuickCmdAdv(psI2C, ui8I2CSlaveAddr, ui8I2CRw, bI2CRepeatedStart);
    // Standard I2C access.
    } else {
        // I2C write.
        if (ui8I2CRw == 0) {
            ui32I2CMasterStatus = I2CMasterWriteAdv(psI2C, ui8I2CSlaveAddr, pui8I2CData, i - 3, bI2CRepeatedStart, bI2CStop);
        // I2C read.
        } else {
            if (i == 3) ui8I2CDataNum = 1;
            else ui8I2CDataNum = pui8I2CData[0];
            if (ui8I2CDataNum > sizeof(pui8I2CData) / sizeof(pui8I2CData[0])) {
                ui8I2CDataNum = sizeof(pui8I2CData) / sizeof(pui8I2CData[0]);
            }
            ui32I2CMasterStatus = I2CMasterReadAdv(psI2C, ui8I2CSlaveAddr, pui8I2CData, ui8I2CDataNum, bI2CRepeatedStart, bI2CStop);
        }
    }
    // Check the I2C status.
    if (ui32I2CMasterStatus) {
        UARTprintf("%s: Error flags from I2C the master %d: 0x%08x", UI_STR_ERROR, ui8I2CPort, ui32I2CMasterStatus);
        if (ui32I2CMasterStatus & I2C_MASTER_INT_TIMEOUT) UARTprintf("\n%s: I2C timeout.", UI_STR_ERROR);
        if (ui32I2CMasterStatus & I2C_MASTER_INT_NACK) UARTprintf("\n%s: NACK received.", UI_STR_ERROR);
        if (ui32I2CMasterStatus & I2C_MASTER_INT_ARB_LOST) UARTprintf("\n%s: I2C bus arbitration lost.", UI_STR_ERROR);
        if (ui32I2CMasterStatus & 0x1) UARTprintf("\n%s: Unknown error.", UI_STR_ERROR);
    } else {
        UARTprintf("%s.", UI_STR_OK);
        if (ui8I2CRw && !bI2CQuickCmd) {
            UARTprintf(" Data:");
            for (i = 0; i < ui8I2CDataNum; i++) UARTprintf(" 0x%02x", pui8I2CData[i]);
        }
    }

    return 0;
}



// Show help on I2C access command.
void I2CAccessHelp(void)
{
    UARTprintf("I2C access command:\n");
    UARTprintf("  i2c     PORT SLV-ADR ACC NUM|DATA   I2C access (ACC bits: R/W, Sr, nP, Q).\n");
    UARTprintf("I2C access mode (ACC) bits:\n");
    UARTprintf("  0: Read/write (R/W)                 0 = write, 1 = read\n");
    UARTprintf("  1: Repeated start (Sr)              0 = no Sr, 1 = Sr\n");
    UARTprintf("  2: No stop condition (nP)           0 = generate stop cond. P, 1 = omit P\n");
    UARTprintf("  3: Quick command (Q)                0 = no Q, 1 = Q");
}



// Check if the I2C port number is valid. If so, set the psI2C pointer to the
// selected I2C port struct.
int I2CPortCheck(uint8_t ui8I2CPort, tI2C **psI2C)
{
    switch (ui8I2CPort) {
        case 0: *psI2C = &g_sI2C0; break;
        case 2: *psI2C = &g_sI2C2; break;
        default:
            *psI2C = NULL;
            UARTprintf("%s: Only I2C port numbers 0 and 2 are supported!", UI_STR_ERROR);
            return -1;
    }
    return 0;
}



