fras/tm4c1294-hw-demo/Firmware/hw_demo.c
    return 0;
}



// Check if the SSI port number is valid. If so, set the psSsi pointer to the
// selected SSI port struct.
int SsiPortCheck(uint8_t ui8SsiPort, tSSI **psSsi)
{
    switch (ui8SsiPort) {
        case 2: *psSsi = &g_sSsi2; break;
        case 3: *psSsi = &g_sSsi3; break;
        default:
            *psSsi = NULL;
            UARTprintf("%s: Only SSI port numbers 2 and 3 are supported!", UI_STR_ERROR);
            return -1;
    }
    return 0;
}



// Set up the SSI interface.
int SsiSetup(char *pcCmd, char *pcParam)
{
    int i;
    uint8_t ui8SsiPort = 0;
    uint32_t ui32SsiBitRate;
    uint32_t ui32SsiProtocol;
    uint32_t ui32SsiDataWidth;
    tSSI *psSsi;
    // Parse parameters.
    for (i = 0; i <= 3; i++) {
        if (i != 0) pcParam = strtok(NULL, UI_STR_DELIMITER);
        if (i == 0) {
            if (pcParam == NULL) {
                UARTprintf("%s: SSI port number required after command `%s'.\n", UI_STR_ERROR, pcCmd);
                SsiSetupHelp();
                return -1;
            } else {
                ui8SsiPort = (uint8_t) strtoul(pcParam, (char **) NULL, 0) & 0xff;
            }
        } else if (i == 1) {
            if (pcParam == NULL) {
                UARTprintf("%s: SSI bit rate required after command `%s'.\n", UI_STR_ERROR, pcCmd);
                SsiSetupHelp();
                return -1;
            } else {
                ui32SsiBitRate = (uint32_t) strtoul(pcParam, (char **) NULL, 0);
                if ((ui32SsiBitRate < SSI_FREQ_MIN) || (ui32SsiBitRate > SSI_FREQ_MAX)) {
                    UARTprintf("%s: SSI bit rate %d outside of valid range %d..%d.", UI_STR_ERROR, ui32SsiBitRate, SSI_FREQ_MIN, SSI_FREQ_MAX);
                    return -1;
                }
            }
        } else if (i == 2) {
            if (pcParam == NULL) {
                ui32SsiProtocol = SSI_FRF_MOTO_MODE_0;
            } else {
                ui32SsiProtocol = strtoul(pcParam, (char **) NULL, 0) & 0x07;
                switch (ui32SsiProtocol) {
                    case 0: ui32SsiProtocol = SSI_FRF_MOTO_MODE_0; break;
                    case 1: ui32SsiProtocol = SSI_FRF_MOTO_MODE_1; break;
                    case 2: ui32SsiProtocol = SSI_FRF_MOTO_MODE_2; break;
                    case 3: ui32SsiProtocol = SSI_FRF_MOTO_MODE_3; break;
                    case 4: ui32SsiProtocol = SSI_FRF_TI; break;
                    case 5: ui32SsiProtocol = SSI_FRF_NMW; break;
                    default:
                        UARTprintf("%s: Invalid SSI mode setting %d.", UI_STR_ERROR, ui32SsiProtocol);
                        return -1;
                }
            }
        } else if (i == 3) {
            if (pcParam == NULL) {
                ui32SsiDataWidth = 8;
            } else {
                ui32SsiDataWidth = strtoul(pcParam, (char **) NULL, 0);
                if ((ui32SsiDataWidth < SSI_DATAWIDTH_MIN) || (ui32SsiDataWidth > SSI_DATAWIDTH_MAX)) {
                    UARTprintf("%s: SSI data width %d outside of valid range %d..%d.", UI_STR_ERROR, ui32SsiDataWidth, SSI_DATAWIDTH_MIN, SSI_DATAWIDTH_MAX);
                    return -1;
                }
            }
        }
    }
    if (i < 1) return -1;
    // Check if the SSI port number is valid. If so, set the psSsi pointer to the selected SSI port struct.
    if (SsiPortCheck(ui8SsiPort, &psSsi)) return -1;
    // Set up the SSI port.
    psSsi->ui32BitRate = ui32SsiBitRate;
    psSsi->ui32Protocol = ui32SsiProtocol;
    psSsi->ui32DataWidth = ui32SsiDataWidth;
    SsiMasterInit(psSsi);

    UARTprintf("%s.", UI_STR_OK);

    return 0;
}



// Show help on the SSI setup command.
void SsiSetupHelp(void)
{
    UARTprintf("SSI setup command:\n");
    UARTprintf("  ssi-set PORT FREQ [MODE] [WIDTH]    Set up the SSI port.\n");
    UARTprintf("SSI bit rate: %d..%d\n", SSI_FREQ_MIN, SSI_FREQ_MAX);
    UARTprintf("SSI modes:\n");
    UARTprintf("  0: SPI frame format, polarity = 0, phase = 0.\n");
    UARTprintf("  1: SPI frame format, polarity = 0, phase = 1.\n");
    UARTprintf("  2: SPI frame format, polarity = 1, phase = 0.\n");
    UARTprintf("  3: SPI frame format, polarity = 1, phase = 1.\n");
    UARTprintf("  4: TI frame format.\n");
    UARTprintf("  5: National MicroWire frame format.\n");
    UARTprintf("SSI data width: %d..%d", SSI_DATAWIDTH_MIN, SSI_DATAWIDTH_MAX);
}



// UART access.
int UartAccess(char *pcCmd, char *pcParam)
{
    int i;
    uint8_t ui8UartPort = 0;
    uint8_t ui8UartRw = 0;  // 0 = write; 1 = read
    uint8_t ui8UartDataNum = 0;
    uint8_t pui8UartData[32];
    tUART *psUart;
    int32_t i32UartStatus;
    // Parse parameters.
    for (i = 0; i < sizeof(pui8UartData) / sizeof(pui8UartData[0]); i++) {
        if (i != 0) pcParam = strtok(NULL, UI_STR_DELIMITER);
        if (i == 0) {
            if (pcParam == NULL) {
                UARTprintf("%s: UART port number required after command `%s'.", UI_STR_ERROR, pcCmd);
                return -1;
            } else {
                ui8UartPort = (uint8_t) strtoul(pcParam, (char **) NULL, 0) & 0xff;
            }
        } else if (i == 1) {
            if (pcParam == NULL) {
                UARTprintf("%s: UART read/write required after command `%s'.", UI_STR_ERROR, pcCmd);
                return -1;
            } else {
                ui8UartRw = (uint8_t) strtoul(pcParam, (char **) NULL, 0) & 0x01;
            }
        } else {
            if (i == 2 && ui8UartRw == 0 && pcParam == NULL) {
                UARTprintf("%s: At least one data byte required after UART write command `%s'.", UI_STR_ERROR, pcCmd);
                return -1;
            }
            if (pcParam == NULL) break;
            else pui8UartData[i-2] = (uint8_t) strtoul(pcParam, (char **) NULL, 0) & 0xff;
        }
    }
    if (i < 2) return -1;
    // Check if the UART port number is valid. If so, set the psUart pointer to the selected UART port struct.
    if (UartPortCheck(ui8UartPort, &psUart)) return -1;
    // UART write.
    if (ui8UartRw == 0) {
        i32UartStatus = UartWrite(psUart, pui8UartData, i - 2);
        // Check the UART status.
        if (i32UartStatus) {
            UARTprintf("%s: Error status from the UART %d: %d", UI_STR_ERROR, ui8UartPort, i32UartStatus);
        } else {
            UARTprintf("%s.", UI_STR_OK);
        }
    // UART read.
    } else {
        if (i == 2) ui8UartDataNum = 1;
        // Read all available data.
        if (i == 2) {
            for (int iCnt = 0; ; iCnt++) {
                i32UartStatus = UartRead(psUart, pui8UartData, 1);
                if (i32UartStatus != 1) {
                    if (iCnt == 0) UARTprintf("%s: No data available.", UI_STR_WARNING);
                    break;
                } else {
                    if (iCnt == 0) UARTprintf("%s. Data:", UI_STR_OK);
                    UARTprintf(" 0x%02x", pui8UartData[0]);
                }
            }
        // Read given number of data.
        } else {
            ui8UartDataNum = pui8UartData[0];
            if (ui8UartDataNum > sizeof(pui8UartData) / sizeof(pui8UartData[0])) {
                ui8UartDataNum = sizeof(pui8UartData) / sizeof(pui8UartData[0]);
            }
            i32UartStatus = UartRead(psUart, pui8UartData, ui8UartDataNum);
            // Check the UART status.
            if (i32UartStatus != ui8UartDataNum) {
                UARTprintf("%s: Could only read %d data bytes from the UART %d instead of %d.", UI_STR_WARNING, i32UartStatus, ui8UartPort, ui8UartDataNum);
            } else {
                UARTprintf("%s.", UI_STR_OK);
            }
            if (i32UartStatus > 0) {
                UARTprintf(" Data:");
                for (i = 0; i < i32UartStatus; i++) UARTprintf(" 0x%02x", pui8UartData[i]);
            }
        }
    }

