fras/tm4c1294-hw-demo/Firmware/hw_demo.c
    return 0;
}



// Check if the UART port number is valid. If so, set the psUart pointer to the
// selected UART port struct.
int UartPortCheck(uint8_t ui8UartPort, tUART **psUart)
{
    switch (ui8UartPort) {
        case 6: *psUart = &g_sUart6; break;
        default:
            *psUart = NULL;
            UARTprintf("%s: Only UART port number 6 is supported!", UI_STR_ERROR);
            return -1;
    }
    return 0;
}



// Set up the UART port.
int UartSetup(char *pcCmd, char *pcParam)
{
    int i;
    uint8_t ui8UartPort = 0;
    uint32_t ui32UartBaud;
    uint32_t ui32UartParity;
    bool bUartLoopback;
    tUART *psUart;
    // Parse parameters.
    for (i = 0; i <= 3; i++) {
        if (i != 0) pcParam = strtok(NULL, UI_STR_DELIMITER);
        if (i == 0) {
            if (pcParam == NULL) {
                UARTprintf("%s: UART port number required after command `%s'.\n", UI_STR_ERROR, pcCmd);
                UartSetupHelp();
                return -1;
            } else {
                ui8UartPort = (uint8_t) strtoul(pcParam, (char **) NULL, 0) & 0xff;
            }
        } else if (i == 1) {
            if (pcParam == NULL) {
                UARTprintf("%s: UART baud rate required after command `%s'.\n", UI_STR_ERROR, pcCmd);
                UartSetupHelp();
                return -1;
            } else {
                ui32UartBaud = (uint32_t) strtoul(pcParam, (char **) NULL, 0);
                if ((ui32UartBaud < UART_BAUD_MIN) || (ui32UartBaud > UART_BAUD_MAX)) {
                    UARTprintf("%s: UART baud rate %d outside of valid range %d..%d.", UI_STR_ERROR, ui32UartBaud, UART_BAUD_MIN, UART_BAUD_MAX);
                    return -1;
                }
            }
        } else if (i == 2) {
            if (pcParam == NULL) {
                ui32UartParity = UART_CONFIG_PAR_NONE;
            } else {
                ui32UartParity = strtoul(pcParam, (char **) NULL, 0) & 0x07;
                switch (ui32UartParity) {
                    case 0: ui32UartParity = UART_CONFIG_PAR_NONE; break;
                    case 1: ui32UartParity = UART_CONFIG_PAR_EVEN; break;
                    case 2: ui32UartParity = UART_CONFIG_PAR_ODD; break;
                    case 3: ui32UartParity = UART_CONFIG_PAR_ONE; break;
                    case 4: ui32UartParity = UART_CONFIG_PAR_ZERO; break;
                    default:
                        UARTprintf("%s: Invalid UART parity setting %d.", UI_STR_ERROR, ui32UartParity);
                        return -1;
                }
            }
        } else if (i == 3) {
            if (pcParam == NULL) {
                bUartLoopback = false;
            } else {
                bUartLoopback = (bool) strtoul(pcParam, (char **) NULL, 0) & 0x01;
            }
        }
    }
    if (i < 1) return -1;
    // Check if the UART port number is valid. If so, set the psUart pointer to the selected UART port struct.
    if (UartPortCheck(ui8UartPort, &psUart)) return -1;
    // Set up the UART.
    psUart->ui32Baud = ui32UartBaud;
    psUart->bLoopback = bUartLoopback;
    UartInit(psUart);
    UARTParityModeSet(psUart->ui32BaseUart, ui32UartParity);

    UARTprintf("%s.", UI_STR_OK);

    return 0;
}



// Show help on the UART setup command.
void UartSetupHelp(void)
{
    UARTprintf("UART setup command:\n");
    UARTprintf("  uart-s  PORT BAUD [PARITY] [LOOP]   Set up the UART port.");
    UARTprintf("UART baud rate: %d..%d\n", UART_BAUD_MIN, UART_BAUD_MAX);
    UARTprintf("UART partiy options:\n");
    UARTprintf("  0: None.\n");
    UARTprintf("  1: Even.\n");
    UARTprintf("  2: Odd.\n");
    UARTprintf("  3: One.\n");
    UARTprintf("  4: Zero.");
    UARTprintf("UART loopback options:\n");
    UARTprintf("  0: No loopback.\n");
    UARTprintf("  1: Enable internal loopback mode.\n");
}

